Revit 2027 API
ExporterIFC.SetFile Method
 Sets the handle to the IFC file being created during this export operation.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetFile(
	IFCFile file
)
Public Sub SetFile (
	file As IFCFile
)
public:
void SetFile(
	IFCFile^ file
)
member SetFile :
        file : IFCFile -> unit
Parameters
file IFCFile
 The handle to the file.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace